-- Active: 1696270359359@@127.0.0.1@3306
-- 1. Фильмы
INSERT INTO movies
VALUES 
    (1, 'Начало'),
    (2, 'История игрушек 3'),
    (3, 'Социальная сеть'),
    (4, 'Черный лебедь'),
    (5, 'Король говорит!');

-- 2. Типы аттрибутов
INSERT INTO attributetypes (id, name)
VALUES 
    (1, 'string'),
    (2, 'int'),
    (3, 'double'),
    (4, 'date'),
    (5, 'boolean');

-- 3. Аттрибуты
INSERT INTO attributes (id, type_id, name)
VALUES
    (1, 1, 'Рецензия критика'),
    (2, 1, 'Отзыв киноакадемии'),
    (3, 5, 'Премия Оскар'),
    (4, 5, 'Премия Ника'),
    (5, 4, 'Мировая премьера'),
    (6, 4, 'Премьера в РФ'),
    (7, 4, 'Дата начала продажи билетов'),
    (8, 4, 'Дата запуска рекламы на ТВ'),
    (9, 2, 'Год выхода'),
    (10, 3, 'Бюджет'),
    (11, 1, 'Страна');

-- 4. Значения
INSERT INTO attributevalues (movie_id, attribute_id, value_str)
VALUES
    -- Начало
    (2, 1, 'Отзыв о фильме "Начало" ...'),
    (2, 2, 'Рецензия киноакадемии на фильм "Начало" ...'),
    -- История игрушек 3
    (2, 1, 'Отзыв о фильме "История игрушек 3" ...'),
    (2, 2, 'Рецензия киноакадемии на фильм "История игрушек 3" ...'),
    -- Социальная сеть
    (3, 1, 'Отзыв о фильме "Социальная сеть" ...'),
    (3, 2, 'Рецензия киноакадемии на фильм "Социальная сеть" ...'),
    -- Черный лебедь
    (4, 1, 'Отзыв о фильме "Черный лебедь" ...'),
    (4, 2, 'Рецензия киноакадемии на фильм "Черный лебедь" ...'),
    -- Король говорит!
    (5, 1, 'Отзыв о фильме "Король говорит!" ...'),
    (5, 2, 'Рецензия киноакадемии на фильм "Король говорит!" ...');

INSERT INTO attributevalues (movie_id, attribute_id, value_bln)
VALUES
    -- Начало
    (1, 3, TRUE),
    (1, 4, FALSE),    
    -- История игрушек 3
    (2, 3, FALSE),
    (2, 4, TRUE),
    -- Социальная сеть
    (3, 3, TRUE),
    (3, 4, FALSE),
    -- Черный лебедь
    (4, 3, FALSE),
    (4, 4, TRUE),
    -- Король говорит!
    (5, 3, FALSE),
    (5, 4, FALSE);

INSERT INTO attributevalues (movie_id, attribute_id, value_dte)
VALUES
    -- Начало
    (1, 5, '2010-07-08'),
    (1, 6, '2010-07-22'),
    (1, 7, CURRENT_DATE + INTERVAL '20 days'),
    (1, 8, CURRENT_DATE + INTERVAL '4 days'),    
    -- История игрушек 3
    (2, 5, '2010-06-12'),
    (2, 6, '2010-06-18'),
    (2, 7, CURRENT_DATE + INTERVAL '15 days'),
    (2, 8, CURRENT_DATE + INTERVAL '1 days'),
    -- Социальная сеть
    (3, 5, '2010-09-24'),
    (3, 6, '2010-10-01'),
    (3, 7, CURRENT_DATE),
    (3, 8, CURRENT_DATE - INTERVAL '20 days'),
    -- Черный лебедь
    (4, 5, '2010-09-01'),
    (4, 6, '2010-09-15'),
    (4, 7, CURRENT_DATE + INTERVAL '20 days'),
    (4, 8, CURRENT_DATE),
    -- Король говорит!
    (5, 5, '2010-09-06'),
    (5, 6, '2010-09-23'),
    (5, 7, CURRENT_DATE + INTERVAL '39 days'),
    (5, 8, CURRENT_DATE + INTERVAL '20 days');

INSERT INTO attributevalues (movie_id, attribute_id, value_int)
VALUES
    (1, 9, 2010),
    (2, 9, 2010),
    (3, 9, 2010),
    (4, 9, 2010),
    (5, 9, 2010);

INSERT INTO attributevalues (movie_id, attribute_id, value_dbl)
VALUES
    (1, 10, 160000000.00),
    (2, 10, 200000000.00),
    (3, 10, 40000000.00),
    (4, 10, 13000000.00),
    (5, 10, 15000000.00);

INSERT INTO attributevalues (movie_id, attribute_id, value_str)
VALUES
    (1, 11, 'США, Великобритания'),
    (2, 11, 'США'),
    (3, 11, 'США'),
    (4, 11, 'США'),
    (5, 11, 'Великобритания');