INSERT INTO attribute_type (name)
VALUES
    ('date'),
    ('image'),
    ('text');


INSERT INTO attribute (name, attribute_type_id)
VALUES
    ('Страна', 3),
    ('Жанр', 3),
    ('Постер', 2),
    ('Дата премьеры', 1),
    ('Оскар', 3),
    ('Рецензия', 3),
    ('Служебная дата', 3);

INSERT INTO value (value, movie_id, attribute_id)
VALUES
    ('Россия', 1, 1),
    ('Боевик', 1, 2),
    ('poster.jpg', 1, 3),
    ('2023.12.25 00:00:00', 1, 4),
    ('Да', 1, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.13 00:00:00', 1, 7),

    ('Россия', 2, 1),
    ('Драма', 2, 2),
    ('poster.jpg', 2, 3),
    ('2023.12.25 00:00:00', 2, 4),
    ('Да', 2, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.13 00:00:00', 1, 7),

    ('Россия', 3, 1),
    ('Драма', 3, 2),
    ('poster.jpg', 3, 3),
    ('2023.12.25 00:00:00', 3, 4),
    ('Да', 3, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.13 00:00:00', 1, 7),

    ('Россия', 4, 1),
    ('Драма', 4, 2),
    ('poster.jpg', 4, 3),
    ('2023.12.25 00:00:00', 4, 4),
    ('Да', 4, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.13 00:00:00', 1, 7),

    ('Россия', 5, 1),
    ('Комедия', 5, 2),
    ('poster.jpg', 5, 3),
    ('2023.12.25 00:00:00', 5, 4),
    ('Да', 5, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.14 00:00:00', 1, 7),

    ('США', 6, 1),
    ('Фантастика', 6, 2),
    ('poster.jpg', 6, 3),
    ('2023.12.25 00:00:00', 6, 4),
    ('Нет', 6, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.14 00:00:00', 1, 7),

    ('США', 7, 1),
    ('Фантастика', 7, 2),
    ('poster.jpg', 7, 3),
    ('2023.12.25 00:00:00', 7, 4),
    ('Нет', 7, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.14 00:00:00', 1, 7),

    ('США', 8, 1),
    ('Фантастика', 8, 2),
    ('poster.jpg', 8, 3),
    ('2023.12.25 00:00:00', 8, 4),
    ('Нет', 8, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.14 00:00:00', 1, 7),

    ('США', 9, 1),
    ('Мультфильм', 9, 2),
    ('poster.jpg', 9, 3),
    ('2023.12.25 00:00:00', 9, 4),
    ('Нет', 9, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.14 00:00:00', 1, 7),

    ('США', 10, 1),
    ('Фантастика', 10, 2),
    ('poster.jpg', 10, 3),
    ('2023.12.15 00:00:00', 10, 4),
    ('Нет', 10, 5),
    ('Рецензия на фильм', 1, 6),
    ('2024.01.15 00:00:00', 1, 7);