# Используйте официальный образ PHP в качестве базового
FROM php:latest

# Установка расширения phpredis
RUN pecl install redis \
    && docker-php-ext-enable redis

# Копирование приложения в контейнер

# Установка зависимостей, если они есть
# (например, если у вас есть composer.json)
# RUN composer install

# Порт, который ваше приложение слушает (если требуется)
EXPOSE 80

# Запуск вашего приложения (в данном примере, это просто скрипт)
CMD ["php", "-S", "0.0.0.0:80", "-t", "/var/www/html"]
