INSERT INTO halls (title, capacity) VALUES
	('Большой зал', 200),
	('Малый зал', 100),
	('IMAX зал', 150);
	
INSERT INTO genres (title) VALUES
	('Боевик'),
	('Фэнтези'),
	('Фантастика'),
	('Комедия'),
	('Триллер');
	
INSERT INTO movies (genre_id, title, duration, rating) VALUES
	(1, 'Командо', 100, 4),
	(2, 'Властелин колец: Возвращение короля', 185, 5),
	(3, 'Терминатор', 154, 4),
	(4, 'Операция Ы', 90, 5),
	(5, 'Семь', 160, 3);

INSERT INTO seances (hall_id, movie_id, base_price, start_time) VALUES
	(1, 1, 200.00, '2023-12-06 10:00'),
	(1, 2, 250.00, '2023-12-06 18:00'),
	(2, 3, 150.00, '2023-12-06 14:00'),
	(3, 4, 250.00, '2023-12-06 18:00'),
	(2, 5, 200.00, '2023-12-06 21:00');

INSERT INTO type_seats (title) VALUES
	('Обычный'),
	('VIP');

INSERT INTO seats (hall_id, type_seats_id, seat_number, number_row, price_modifier) VALUES
	(1, 1, 1, 1, 1.00),
	(1, 1, 2, 1, 1.00),
	(1, 1, 3, 1, 1.00),
	(1, 2, 4, 2, 1.20),
	(2, 1, 1, 1, 1.00),
	(2, 1, 2, 1, 1.00),
	(2, 2, 3, 2, 1.20),
	(3, 1, 1, 1, 1.00),
	(3, 1, 2, 1, 1.00),
	(3, 2, 3, 2, 1.20);

INSERT INTO tickets (seance_id, seat_id, price, purchased_time) VALUES
	(1, 1, 200.00, '2023-12-05 10:00'),
	(1, 2, 200.00, '2023-12-05 10:00'),
	(1, 3, 200.00, '2023-12-05 10:00'),
	(2, 4, 300.00, '2023-12-05 10:00'),
	(3, 5, 150.00, '2023-12-05 10:00'),
	(3, 6, 150.00, '2023-12-05 10:00');
	