INSERT INTO halls (name, capacity)
VALUES ('Зал 1', 8),
       ('Зал 2', 8),
       ('Зал 3', 8);

INSERT INTO movies (title, genre, duration)
VALUES ('Властелин колец: Возвращение короля', 'Фэнтези', 142),
       ('Звёздные войны: Эпизод 5 — Империя наносит ответный удар', 'Фэнтези', 124),
       ('Побег из Шоушенка', 'Драма', 142),
       ('Темный рыцарь', 'Фантастика', 152);

INSERT INTO sessions (hall_id, movie_id, start_time)
VALUES (1, 1, '2024-01-01 20:00:00'),
       (2, 2, '2024-02-15 20:30:00'),
       (3, 4, '2024-03-17 20:30:00'),
       (3, 3, '2024-01-23 20:45:00');

INSERT INTO tickets (sessions_id, seat_row, seat_place, price)
VALUES (1, 1, 1, 320),
       (1, 1, 2, 320),
       (1, 1, 3, 320),
       (1, 1, 4, 320),
       (1, 2, 1, 330),
       (1, 2, 2, 330),
       (1, 2, 3, 330),
       (1, 2, 4, 330),
       (2, 1, 1, 240),
       (2, 1, 2, 240),
       (2, 1, 3, 240),
       (2, 1, 4, 240),
       (2, 2, 1, 280),
       (2, 2, 2, 280),
       (2, 2, 3, 280),
       (2, 2, 4, 280),
       (3, 1, 1, 270),
       (3, 1, 2, 270),
       (3, 1, 3, 270),
       (3, 1, 4, 270),
       (3, 2, 1, 290),
       (3, 2, 2, 290),
       (3, 2, 3, 290),
       (3, 2, 4, 290),
       (4, 1, 1, 390),
       (4, 1, 2, 390),
       (4, 1, 3, 390),
       (4, 1, 4, 390),
       (4, 2, 1, 410),
       (4, 2, 2, 410),
       (4, 2, 3, 410),
       (4, 2, 4, 410);

INSERT INTO users (phone, name, surname)
VALUES (71234567890, 'Иван', 'Иванов'),
       (76541234376, 'Петр', 'Петров'),
       (79909999999, 'Елизавета', 'Егорова'),
       (79908888888, 'Алексей', 'Ковалев'),
       (79977777777, 'Ольга', 'Степанова'),
       (79333333333, 'Игорь', 'Игорев');

INSERT INTO orders (ticket_id, user_id)
VALUES (1, 1),
       (2, 1),
       (3, 1),
       (4, 1),
       (5, 1),
       (6, 1),
       (7, 1),
       (8, 1),
       (10, 2),
       (11, 3),
       (21, 4),
       (22, 5),
       (30, 6);
