insert into public.movie_attribute (movie_id, attr_id, attr_name, attr_type)
values  (1, 1, 'рецензии', 1),
        (1, 2, 'рецензии', 1),
        (2, 4, 'рецензии', 1),
        (2, 3, 'рецензии', 1),
        (1, 5, 'премия', 2),
        (2, 6, 'премия', 2),
        (1, 7, 'мировая премьера', 3),
        (1, 8, 'премьера в РФ', 3),
        (2, 9, 'премьера в РФ', 3),
        (1, 12, 'когда снимать с проката', 4),
        (2, 11, 'дата начала продажи билетов', 4),
        (2, 13, 'когда снимать с проката', 4),
        (1, 10, 'дата начала продажи билетов', 4);