

-- примерное расположение мест в соответствующем зале
-- строка соответствует номеру_в_ряду
-- столбец соответствует номеру_ряда (максимум 10 рядов)
select
    max(case when (l."row"=0) then (l.name||'::'||uc.name) else null end) as '0',
    max(case when (l."row"=1) then (l.name||'::'||uc.name) else null end) as '1',
    max(case when (l."row"=2) then (l.name||'::'||uc.name) else null end) as '2',
    max(case when (l."row"=3) then (l.name||'::'||uc.name) else null end) as '3',
    max(case when (l."row"=4) then (l.name||'::'||uc.name) else null end) as '4',
    max(case when (l."row"=5) then (l.name||'::'||uc.name) else null end) as '5',
    max(case when (l."row"=6) then (l.name||'::'||uc.name) else null end) as '6',
    max(case when (l."row"=7) then (l.name||'::'||uc.name) else null end) as '7',
    max(case when (l."row"=8) then (l.name||'::'||uc.name) else null end) as '8',
    max(case when (l."row"=9) then (l.name||'::'||uc.name) else null end) as '9',
    max(case when(l."row"=10) then (l.name||'::'||uc.name) else null end) as '10'
from
    '_location' l
    join '_seating_position' sp on sp.location_id = l.id
    join '_ui_color' uc on uc.id = (sp.attendance_rate/20)
where l.floor =1 and sp.hall_id = 3
GROUP BY l.number_in_row;

-- зал 1
/*
|0  |1            |2             |3             |4  |5  |6  |7  |8  |9  |10 |
|---|-------------|--------------|--------------|---|---|---|---|---|---|---|
|   |1-01-01::blue|1-02-01::blue |1-03-01::blue |   |   |   |   |   |   |   |
|   |1-01-02::blue|1-02-02::green|1-03-02::green|   |   |   |   |   |   |   |
|   |1-01-03::blue|1-02-03::green|1-03-03::green|   |   |   |   |   |   |   |
|   |1-01-04::blue|1-02-04::blue |1-03-04::blue |   |   |   |   |   |   |   |
*/

-- зал 2
/*
|0  |1            |2             |3             |4  |5  |6  |7  |8  |9  |10 |
|---|-------------|--------------|--------------|---|---|---|---|---|---|---|
|   |1-01-01::blue|1-02-01::blue |1-03-01::blue |   |   |   |   |   |   |   |
|   |1-01-02::blue|1-02-02::green|1-03-02::green|   |   |   |   |   |   |   |
|   |1-01-03::blue|1-02-03::green|1-03-03::green|   |   |   |   |   |   |   |
|   |1-01-04::blue|1-02-04::green|1-03-04::green|   |   |   |   |   |   |   |
|   |             |1-02-05::green|1-03-05::green|   |   |   |   |   |   |   |
|   |             |1-02-06::blue |1-03-06::blue |   |   |   |   |   |   |   |
*/

-- зал 3
/*
|0            |1            |2            |3             |4             |5             |6             |7             |8             |9             |10            |
|-------------|-------------|-------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|
|1-00-01::blue|1-01-01::blue|1-02-01::blue|1-03-01::blue |1-04-01::blue |1-05-01::blue |1-06-01::blue |1-07-01::blue |1-08-01::blue |1-09-01::blue |1-10-01::blue |
|1-00-02::blue|1-01-02::blue|1-02-02::blue|1-03-02::blue |1-04-02::blue |1-05-02::blue |1-06-02::blue |1-07-02::blue |1-08-02::blue |1-09-02::blue |1-10-02::blue |
|1-00-03::blue|1-01-03::blue|1-02-03::blue|1-03-03::blue |1-04-03::blue |1-05-03::blue |1-06-03::blue |1-07-03::blue |1-08-03::blue |1-09-03::blue |1-10-03::blue |
|1-00-04::blue|1-01-04::blue|1-02-04::blue|1-03-04::blue |1-04-04::blue |1-05-04::blue |1-06-04::blue |1-07-04::blue |1-08-04::blue |1-09-04::blue |1-10-04::blue |
|1-00-05::blue|1-01-05::blue|1-02-05::blue|1-03-05::blue |1-04-05::blue |1-05-05::blue |1-06-05::blue |1-07-05::blue |1-08-05::blue |1-09-05::blue |1-10-05::blue |
|1-00-06::blue|1-01-06::blue|1-02-06::blue|1-03-06::green|1-04-06::green|1-05-06::green|1-06-06::green|1-07-06::green|1-08-06::green|1-09-06::green|1-10-06::green|
|1-00-07::blue|1-01-07::blue|1-02-07::blue|1-03-07::green|1-04-07::green|1-05-07::green|1-06-07::green|1-07-07::green|1-08-07::green|1-09-07::green|1-10-07::green|
|1-00-08::blue|1-01-08::blue|1-02-08::blue|1-03-08::green|1-04-08::green|1-05-08::green|1-06-08::green|1-07-08::green|1-08-08::green|1-09-08::green|1-10-08::green|
|1-00-09::blue|1-01-09::blue|1-02-09::blue|1-03-09::green|1-04-09::green|1-05-09::green|1-06-09::green|1-07-09::green|1-08-09::green|1-09-09::green|1-10-09::green|
|1-00-10::blue|1-01-10::blue|1-02-10::blue|1-03-10::green|1-04-10::green|1-05-10::green|1-06-10::green|1-07-10::green|1-08-10::green|1-09-10::green|1-10-10::green|
|1-00-11::blue|1-01-11::blue|1-02-11::blue|1-03-11::green|1-04-11::green|1-05-11::green|1-06-11::green|1-07-11::green|1-08-11::green|1-09-11::green|1-10-11::green|
|1-00-12::blue|1-01-12::blue|1-02-12::blue|1-03-12::green|1-04-12::green|1-05-12::green|1-06-12::green|1-07-12::green|1-08-12::green|1-09-12::green|1-10-12::green|
|1-00-13::blue|1-01-13::blue|1-02-13::blue|1-03-13::green|1-04-13::green|1-05-13::green|1-06-13::green|1-07-13::green|1-08-13::green|1-09-13::green|1-10-13::green|
|1-00-14::blue|1-01-14::blue|1-02-14::blue|1-03-14::green|1-04-14::green|1-05-14::green|1-06-14::green|1-07-14::green|1-08-14::green|1-09-14::green|1-10-14::green|
|1-00-15::blue|1-01-15::blue|1-02-15::blue|1-03-15::green|1-04-15::green|1-05-15::green|1-06-15::green|1-07-15::green|1-08-15::green|1-09-15::green|1-10-15::green|
|1-00-16::blue|1-01-16::blue|1-02-16::blue|1-03-16::green|1-04-16::green|1-05-16::green|1-06-16::green|1-07-16::green|1-08-16::green|1-09-16::green|1-10-16::green|
|1-00-17::blue|1-01-17::blue|1-02-17::blue|1-03-17::green|1-04-17::green|1-05-17::green|1-06-17::green|1-07-17::green|1-08-17::green|1-09-17::green|1-10-17::green|
|1-00-18::blue|1-01-18::blue|1-02-18::blue|1-03-18::green|1-04-18::green|1-05-18::green|1-06-18::green|1-07-18::green|1-08-18::green|1-09-18::green|1-10-18::green|
|1-00-19::blue|1-01-19::blue|1-02-19::blue|1-03-19::green|1-04-19::green|1-05-19::green|1-06-19::green|1-07-19::green|1-08-19::green|1-09-19::green|1-10-19::green|
|             |1-01-20::blue|1-02-20::blue|1-03-20::green|1-04-20::green|1-05-20::green|1-06-20::green|1-07-20::green|1-08-20::green|1-09-20::green|1-10-20::green|
|             |1-01-21::blue|1-02-21::blue|1-03-21::blue |1-04-21::green|1-05-21::green|1-06-21::green|1-07-21::green|1-08-21::green|1-09-21::green|1-10-21::green|
|             |             |1-02-22::blue|1-03-22::blue |1-04-22::green|1-05-22::green|1-06-22::green|1-07-22::green|1-08-22::green|1-09-22::green|1-10-22::green|
|             |             |1-02-23::blue|1-03-23::blue |1-04-23::blue |1-05-23::green|1-06-23::green|1-07-23::green|1-08-23::green|1-09-23::green|1-10-23::green|
|             |             |             |1-03-24::blue |1-04-24::blue |1-05-24::green|1-06-24::green|1-07-24::green|1-08-24::green|1-09-24::green|1-10-24::green|
|             |             |             |              |1-04-25::blue |1-05-25::blue |1-06-25::green|1-07-25::green|1-08-25::green|1-09-25::green|1-10-25::green|
|             |             |             |              |1-04-26::blue |1-05-26::blue |1-06-26::blue |1-07-26::green|1-08-26::green|1-09-26::green|1-10-26::green|
|             |             |             |              |              |1-05-27::blue |1-06-27::blue |1-07-27::green|1-08-27::green|1-09-27::green|1-10-27::green|
|             |             |             |              |              |1-05-28::blue |1-06-28::blue |1-07-28::blue |1-08-28::green|1-09-28::green|1-10-28::green|
|             |             |             |              |              |              |1-06-29::blue |1-07-29::blue |1-08-29::blue |1-09-29::green|1-10-29::green|
|             |             |             |              |              |              |              |1-07-30::blue |1-08-30::blue |1-09-30::green|1-10-30::green|
|             |             |             |              |              |              |              |1-07-31::blue |1-08-31::blue |1-09-31::blue |1-10-31::green|
|             |             |             |              |              |              |              |              |1-08-32::blue |1-09-32::blue |1-10-32::green|
|             |             |             |              |              |              |              |              |              |1-09-33::blue |1-10-33::blue |
|             |             |             |              |              |              |              |              |              |1-09-34::blue |1-10-34::blue |
|             |             |             |              |              |              |              |              |              |              |1-10-35::blue |
|             |             |             |              |              |              |              |              |              |              |1-10-36::blue |
|             |             |             |              |              |              |              |              |              |              |1-10-37::blue |
*/


-- примерное расположение мест в соответствующем зале
-- строка соответствует номеру_ряда (максимум 10 рядов)
-- столбец соответствует номеру_в_ряду (максимум 37 мест в ряду)
select  -- OK
    l."row",
    max(case when (l.number_in_row =1) then (l.name||'::'||uc.name) else null end) as '1',
    max(case when (l.number_in_row =2) then (l.name||'::'||uc.name) else null end) as '2',
    max(case when (l.number_in_row =3) then (l.name||'::'||uc.name) else null end) as '3',
    max(case when (l.number_in_row =4) then (l.name||'::'||uc.name) else null end) as '4',
    max(case when (l.number_in_row =5) then (l.name||'::'||uc.name) else null end) as '5',
    max(case when (l.number_in_row =6) then (l.name||'::'||uc.name) else null end) as '6',
    max(case when (l.number_in_row =7) then (l.name||'::'||uc.name) else null end) as '7',
    max(case when (l.number_in_row =8) then (l.name||'::'||uc.name) else null end) as '8',
    max(case when (l.number_in_row =9) then (l.name||'::'||uc.name) else null end) as '9',
    max(case when (l.number_in_row =10) then (l.name||'::'||uc.name) else null end) as '10',
    max(case when (l.number_in_row =11) then (l.name||'::'||uc.name) else null end) as '11',
    max(case when (l.number_in_row =12) then (l.name||'::'||uc.name) else null end) as '12',
    max(case when (l.number_in_row =13) then (l.name||'::'||uc.name) else null end) as '13',
    max(case when (l.number_in_row =14) then (l.name||'::'||uc.name) else null end) as '14',
    max(case when (l.number_in_row =15) then (l.name||'::'||uc.name) else null end) as '15',
    max(case when (l.number_in_row =16) then (l.name||'::'||uc.name) else null end) as '16',
    max(case when (l.number_in_row =17) then (l.name||'::'||uc.name) else null end) as '17',
    max(case when (l.number_in_row =18) then (l.name||'::'||uc.name) else null end) as '18',
    max(case when (l.number_in_row =19) then (l.name||'::'||uc.name) else null end) as '19',
    max(case when (l.number_in_row =20) then (l.name||'::'||uc.name) else null end) as '20',
    max(case when (l.number_in_row =21) then (l.name||'::'||uc.name) else null end) as '21',
    max(case when (l.number_in_row =22) then (l.name||'::'||uc.name) else null end) as '22',
    max(case when (l.number_in_row =23) then (l.name||'::'||uc.name) else null end) as '23',
    max(case when (l.number_in_row =24) then (l.name||'::'||uc.name) else null end) as '24',
    max(case when (l.number_in_row =25) then (l.name||'::'||uc.name) else null end) as '25',
    max(case when (l.number_in_row =26) then (l.name||'::'||uc.name) else null end) as '26',
    max(case when (l.number_in_row =27) then (l.name||'::'||uc.name) else null end) as '27',
    max(case when (l.number_in_row =28) then (l.name||'::'||uc.name) else null end) as '28',
    max(case when (l.number_in_row =29) then (l.name||'::'||uc.name) else null end) as '29',
    max(case when (l.number_in_row =30) then (l.name||'::'||uc.name) else null end) as '30',
    max(case when (l.number_in_row =31) then (l.name||'::'||uc.name) else null end) as '31',
    max(case when (l.number_in_row =32) then (l.name||'::'||uc.name) else null end) as '32',
    max(case when (l.number_in_row =33) then (l.name||'::'||uc.name) else null end) as '33',
    max(case when (l.number_in_row =34) then (l.name||'::'||uc.name) else null end) as '34',
    max(case when (l.number_in_row =35) then (l.name||'::'||uc.name) else null end) as '35',
    max(case when (l.number_in_row =36) then (l.name||'::'||uc.name) else null end) as '36',
    max(case when (l.number_in_row =37) then (l.name||'::'||uc.name) else null end) as '37'
from
    '_location' l
    join '_seating_position' sp on sp.location_id = l.id
    join '_ui_color' uc on uc.id = (sp.attendance_rate/20)
where l.floor =1 and sp.hall_id = 3
GROUP BY l."row";

-- зал 1
/*
|row|1            |2             |3             |4            |5  |6  |7  |8  |9  |10 |11 |12 |13 |14 |15 |16 |17 |18 |19 |20 |21 |22 |23 |24 |25 |26 |27 |28 |29 |30 |31 |32 |33 |34 |35 |36 |37 |
|---|-------------|--------------|--------------|-------------|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|
|1  |1-01-01::blue|1-01-02::blue |1-01-03::blue |1-01-04::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|2  |1-02-01::blue|1-02-02::green|1-02-03::green|1-02-04::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|3  |1-03-01::blue|1-03-02::green|1-03-03::green|1-03-04::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
*/

-- зал 2
/*
|row|1            |2             |3             |4             |5             |6            |7  |8  |9  |10 |11 |12 |13 |14 |15 |16 |17 |18 |19 |20 |21 |22 |23 |24 |25 |26 |27 |28 |29 |30 |31 |32 |33 |34 |35 |36 |37 |
|---|-------------|--------------|--------------|--------------|--------------|-------------|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|
|1  |1-01-01::blue|1-01-02::blue |1-01-03::blue |1-01-04::blue |              |             |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|2  |1-02-01::blue|1-02-02::green|1-02-03::green|1-02-04::green|1-02-05::green|1-02-06::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|3  |1-03-01::blue|1-03-02::green|1-03-03::green|1-03-04::green|1-03-05::green|1-03-06::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
*/

-- зал 3
/*
|row|1            |2            |3            |4            |5            |6             |7             |8             |9             |10            |11            |12            |13            |14            |15            |16            |17            |18            |19            |20            |21            |22            |23            |24            |25            |26            |27            |28            |29            |30            |31            |32            |33           |34           |35           |36           |37           |
|---|-------------|-------------|-------------|-------------|-------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|-------------|-------------|-------------|-------------|-------------|
|0  |1-00-01::blue|1-00-02::blue|1-00-03::blue|1-00-04::blue|1-00-05::blue|1-00-06::blue |1-00-07::blue |1-00-08::blue |1-00-09::blue |1-00-10::blue |1-00-11::blue |1-00-12::blue |1-00-13::blue |1-00-14::blue |1-00-15::blue |1-00-16::blue |1-00-17::blue |1-00-18::blue |1-00-19::blue |              |              |              |              |              |              |              |              |              |              |              |              |              |             |             |             |             |             |
|1  |1-01-01::blue|1-01-02::blue|1-01-03::blue|1-01-04::blue|1-01-05::blue|1-01-06::blue |1-01-07::blue |1-01-08::blue |1-01-09::blue |1-01-10::blue |1-01-11::blue |1-01-12::blue |1-01-13::blue |1-01-14::blue |1-01-15::blue |1-01-16::blue |1-01-17::blue |1-01-18::blue |1-01-19::blue |1-01-20::blue |1-01-21::blue |              |              |              |              |              |              |              |              |              |              |              |             |             |             |             |             |
|2  |1-02-01::blue|1-02-02::blue|1-02-03::blue|1-02-04::blue|1-02-05::blue|1-02-06::blue |1-02-07::blue |1-02-08::blue |1-02-09::blue |1-02-10::blue |1-02-11::blue |1-02-12::blue |1-02-13::blue |1-02-14::blue |1-02-15::blue |1-02-16::blue |1-02-17::blue |1-02-18::blue |1-02-19::blue |1-02-20::blue |1-02-21::blue |1-02-22::blue |1-02-23::blue |              |              |              |              |              |              |              |              |              |             |             |             |             |             |
|3  |1-03-01::blue|1-03-02::blue|1-03-03::blue|1-03-04::blue|1-03-05::blue|1-03-06::green|1-03-07::green|1-03-08::green|1-03-09::green|1-03-10::green|1-03-11::green|1-03-12::green|1-03-13::green|1-03-14::green|1-03-15::green|1-03-16::green|1-03-17::green|1-03-18::green|1-03-19::green|1-03-20::green|1-03-21::blue |1-03-22::blue |1-03-23::blue |1-03-24::blue |              |              |              |              |              |              |              |              |             |             |             |             |             |
|4  |1-04-01::blue|1-04-02::blue|1-04-03::blue|1-04-04::blue|1-04-05::blue|1-04-06::green|1-04-07::green|1-04-08::green|1-04-09::green|1-04-10::green|1-04-11::green|1-04-12::green|1-04-13::green|1-04-14::green|1-04-15::green|1-04-16::green|1-04-17::green|1-04-18::green|1-04-19::green|1-04-20::green|1-04-21::green|1-04-22::green|1-04-23::blue |1-04-24::blue |1-04-25::blue |1-04-26::blue |              |              |              |              |              |              |             |             |             |             |             |
|5  |1-05-01::blue|1-05-02::blue|1-05-03::blue|1-05-04::blue|1-05-05::blue|1-05-06::green|1-05-07::green|1-05-08::green|1-05-09::green|1-05-10::green|1-05-11::green|1-05-12::green|1-05-13::green|1-05-14::green|1-05-15::green|1-05-16::green|1-05-17::green|1-05-18::green|1-05-19::green|1-05-20::green|1-05-21::green|1-05-22::green|1-05-23::green|1-05-24::green|1-05-25::blue |1-05-26::blue |1-05-27::blue |1-05-28::blue |              |              |              |              |             |             |             |             |             |
|6  |1-06-01::blue|1-06-02::blue|1-06-03::blue|1-06-04::blue|1-06-05::blue|1-06-06::green|1-06-07::green|1-06-08::green|1-06-09::green|1-06-10::green|1-06-11::green|1-06-12::green|1-06-13::green|1-06-14::green|1-06-15::green|1-06-16::green|1-06-17::green|1-06-18::green|1-06-19::green|1-06-20::green|1-06-21::green|1-06-22::green|1-06-23::green|1-06-24::green|1-06-25::green|1-06-26::blue |1-06-27::blue |1-06-28::blue |1-06-29::blue |              |              |              |             |             |             |             |             |
|7  |1-07-01::blue|1-07-02::blue|1-07-03::blue|1-07-04::blue|1-07-05::blue|1-07-06::green|1-07-07::green|1-07-08::green|1-07-09::green|1-07-10::green|1-07-11::green|1-07-12::green|1-07-13::green|1-07-14::green|1-07-15::green|1-07-16::green|1-07-17::green|1-07-18::green|1-07-19::green|1-07-20::green|1-07-21::green|1-07-22::green|1-07-23::green|1-07-24::green|1-07-25::green|1-07-26::green|1-07-27::green|1-07-28::blue |1-07-29::blue |1-07-30::blue |1-07-31::blue |              |             |             |             |             |             |
|8  |1-08-01::blue|1-08-02::blue|1-08-03::blue|1-08-04::blue|1-08-05::blue|1-08-06::green|1-08-07::green|1-08-08::green|1-08-09::green|1-08-10::green|1-08-11::green|1-08-12::green|1-08-13::green|1-08-14::green|1-08-15::green|1-08-16::green|1-08-17::green|1-08-18::green|1-08-19::green|1-08-20::green|1-08-21::green|1-08-22::green|1-08-23::green|1-08-24::green|1-08-25::green|1-08-26::green|1-08-27::green|1-08-28::green|1-08-29::blue |1-08-30::blue |1-08-31::blue |1-08-32::blue |             |             |             |             |             |
|9  |1-09-01::blue|1-09-02::blue|1-09-03::blue|1-09-04::blue|1-09-05::blue|1-09-06::green|1-09-07::green|1-09-08::green|1-09-09::green|1-09-10::green|1-09-11::green|1-09-12::green|1-09-13::green|1-09-14::green|1-09-15::green|1-09-16::green|1-09-17::green|1-09-18::green|1-09-19::green|1-09-20::green|1-09-21::green|1-09-22::green|1-09-23::green|1-09-24::green|1-09-25::green|1-09-26::green|1-09-27::green|1-09-28::green|1-09-29::green|1-09-30::green|1-09-31::blue |1-09-32::blue |1-09-33::blue|1-09-34::blue|             |             |             |
|10 |1-10-01::blue|1-10-02::blue|1-10-03::blue|1-10-04::blue|1-10-05::blue|1-10-06::green|1-10-07::green|1-10-08::green|1-10-09::green|1-10-10::green|1-10-11::green|1-10-12::green|1-10-13::green|1-10-14::green|1-10-15::green|1-10-16::green|1-10-17::green|1-10-18::green|1-10-19::green|1-10-20::green|1-10-21::green|1-10-22::green|1-10-23::green|1-10-24::green|1-10-25::green|1-10-26::green|1-10-27::green|1-10-28::green|1-10-29::green|1-10-30::green|1-10-31::green|1-10-32::green|1-10-33::blue|1-10-34::blue|1-10-35::blue|1-10-36::blue|1-10-37::blue|
*/


-- вывод списка показов для последующей покупки/заказа
SELECT
    ROW_NUMBER () OVER (ORDER BY d.id) AS '###',
        f.name AS 'фильм',
        f.duration_in_minutes AS '(мин.)',
        (s."text" || '_' || h.name || '::' || seat.name) AS 'сеанс',
        ((sp.attendance_rate + d.attendance_rate)*cnf.coefficient) AS 'коэф.цены',
        d.id AS 'идент_показа(служ.)'
FROM '_demostration' AS d
    JOIN '_seating_position' AS sp ON sp.hall_id = d.hall_id
    JOIN '_hall' AS h ON h.id = d.hall_id
    JOIN '_seat' as seat ON seat.id = sp.seat_id
    JOIN '_session' AS s ON s.id = d.session_id
    JOIN '_film' AS f ON f.id = d.film_id
    JOIN '_config' AS cnf ON cnf.id = 1
WHERE seat.name!='@service';

/*
|###|фильм  |(мин.)|сеанс                 |коэф.цены|идент_показа(служ.)|
|---|-------|------|----------------------|---------|-------------------|
|1  |чаплин |58    |утро_@залМалый::01    |123.2    |1                  |
|2  |чаплин |58    |утро_@залМалый::02    |123.2    |1                  |
|3  |чаплин |58    |утро_@залМалый::03    |123.2    |1                  |
|4  |чаплин |58    |утро_@залМалый::04    |123.2    |1                  |
|5  |чаплин |58    |утро_@залМалый::05    |123.2    |1                  |
|6  |чаплин |58    |утро_@залМалый::06    |105.6    |1                  |
|7  |чаплин |58    |утро_@залМалый::07    |105.6    |1                  |
|8  |чаплин |58    |утро_@залМалый::08    |123.2    |1                  |
|9  |чаплин |58    |утро_@залМалый::09    |123.2    |1                  |
|10 |чаплин |58    |утро_@залМалый::10    |105.6    |1                  |
|11 |чаплин |58    |утро_@залМалый::11    |105.6    |1                  |
|12 |чаплин |58    |утро_@залМалый::12    |123.2    |1                  |
|13 |ералаш |140   |вечер_@залМалый::01   |123.2    |2                  |
|14 |ералаш |140   |вечер_@залМалый::02   |123.2    |2                  |
|15 |ералаш |140   |вечер_@залМалый::03   |123.2    |2                  |
|16 |ералаш |140   |вечер_@залМалый::04   |123.2    |2                  |
|17 |ералаш |140   |вечер_@залМалый::05   |123.2    |2                  |
|18 |ералаш |140   |вечер_@залМалый::06   |105.6    |2                  |
|19 |ералаш |140   |вечер_@залМалый::07   |105.6    |2                  |
|20 |ералаш |140   |вечер_@залМалый::08   |123.2    |2                  |
|21 |ералаш |140   |вечер_@залМалый::09   |123.2    |2                  |
|22 |ералаш |140   |вечер_@залМалый::10   |105.6    |2                  |
|23 |ералаш |140   |вечер_@залМалый::11   |105.6    |2                  |
|24 |ералаш |140   |вечер_@залМалый::12   |123.2    |2                  |
|25 |чаплин |58    |утро_@залОсновной::01 |101.2    |3                  |
|26 |чаплин |58    |утро_@залОсновной::02 |101.2    |3                  |
|27 |чаплин |58    |утро_@залОсновной::03 |101.2    |3                  |
|28 |чаплин |58    |утро_@залОсновной::04 |101.2    |3                  |
|29 |чаплин |58    |утро_@залОсновной::05 |101.2    |3                  |
|30 |чаплин |58    |утро_@залОсновной::06 |83.6     |3                  |
|31 |чаплин |58    |утро_@залОсновной::07 |83.6     |3                  |
|32 |чаплин |58    |утро_@залОсновной::08 |83.6     |3                  |
|33 |чаплин |58    |утро_@залОсновной::09 |83.6     |3                  |
|34 |чаплин |58    |утро_@залОсновной::10 |101.2    |3                  |
|35 |чаплин |58    |утро_@залОсновной::11 |101.2    |3                  |
|36 |чаплин |58    |утро_@залОсновной::12 |83.6     |3                  |
|37 |чаплин |58    |утро_@залОсновной::13 |83.6     |3                  |
|38 |чаплин |58    |утро_@залОсновной::14 |83.6     |3                  |
|39 |чаплин |58    |утро_@залОсновной::15 |83.6     |3                  |
|40 |чаплин |58    |утро_@залОсновной::16 |101.2    |3                  |
|41 |фитиль |140   |вечер_@залОсновной::01|88       |4                  |
|42 |фитиль |140   |вечер_@залОсновной::02|88       |4                  |
|43 |фитиль |140   |вечер_@залОсновной::03|88       |4                  |
|44 |фитиль |140   |вечер_@залОсновной::04|88       |4                  |
|45 |фитиль |140   |вечер_@залОсновной::05|88       |4                  |
|46 |фитиль |140   |вечер_@залОсновной::06|70.4     |4                  |
|47 |фитиль |140   |вечер_@залОсновной::07|70.4     |4                  |
|48 |фитиль |140   |вечер_@залОсновной::08|70.4     |4                  |
|49 |фитиль |140   |вечер_@залОсновной::09|70.4     |4                  |
|50 |фитиль |140   |вечер_@залОсновной::10|88       |4                  |
|51 |фитиль |140   |вечер_@залОсновной::11|88       |4                  |
|52 |фитиль |140   |вечер_@залОсновной::12|70.4     |4                  |
|53 |фитиль |140   |вечер_@залОсновной::13|70.4     |4                  |
|54 |фитиль |140   |вечер_@залОсновной::14|70.4     |4                  |
|55 |фитиль |140   |вечер_@залОсновной::15|70.4     |4                  |
|56 |фитиль |140   |вечер_@залОсновной::16|88       |4                  |
|57 |фитиль |140   |вечер_@залМалый::01   |88       |5                  |
|58 |фитиль |140   |вечер_@залМалый::02   |88       |5                  |
|59 |фитиль |140   |вечер_@залМалый::03   |88       |5                  |
|60 |фитиль |140   |вечер_@залМалый::04   |88       |5                  |
|61 |фитиль |140   |вечер_@залМалый::05   |88       |5                  |
|62 |фитиль |140   |вечер_@залМалый::06   |70.4     |5                  |
|63 |фитиль |140   |вечер_@залМалый::07   |70.4     |5                  |
|64 |фитиль |140   |вечер_@залМалый::08   |88       |5                  |
|65 |фитиль |140   |вечер_@залМалый::09   |88       |5                  |
|66 |фитиль |140   |вечер_@залМалый::10   |70.4     |5                  |
|67 |фитиль |140   |вечер_@залМалый::11   |70.4     |5                  |
|68 |фитиль |140   |вечер_@залМалый::12   |88       |5                  |
|69 |титаник|130   |день_@залОсновной::01 |88       |6                  |
|70 |титаник|130   |день_@залОсновной::02 |88       |6                  |
|71 |титаник|130   |день_@залОсновной::03 |88       |6                  |
|72 |титаник|130   |день_@залОсновной::04 |88       |6                  |
|73 |титаник|130   |день_@залОсновной::05 |88       |6                  |
|74 |титаник|130   |день_@залОсновной::06 |70.4     |6                  |
|75 |титаник|130   |день_@залОсновной::07 |70.4     |6                  |
|76 |титаник|130   |день_@залОсновной::08 |70.4     |6                  |
|77 |титаник|130   |день_@залОсновной::09 |70.4     |6                  |
|78 |титаник|130   |день_@залОсновной::10 |88       |6                  |
|79 |титаник|130   |день_@залОсновной::11 |88       |6                  |
|80 |титаник|130   |день_@залОсновной::12 |70.4     |6                  |
|81 |титаник|130   |день_@залОсновной::13 |70.4     |6                  |
|82 |титаник|130   |день_@залОсновной::14 |70.4     |6                  |
|83 |титаник|130   |день_@залОсновной::15 |70.4     |6                  |
|84 |титаник|130   |день_@залОсновной::16 |88       |6                  |
|85 |чаплин |58    |день_@залМалый::01    |136.4    |7                  |
|86 |чаплин |58    |день_@залМалый::02    |136.4    |7                  |
|87 |чаплин |58    |день_@залМалый::03    |136.4    |7                  |
|88 |чаплин |58    |день_@залМалый::04    |136.4    |7                  |
|89 |чаплин |58    |день_@залМалый::05    |136.4    |7                  |
|90 |чаплин |58    |день_@залМалый::06    |118.8    |7                  |
|91 |чаплин |58    |день_@залМалый::07    |118.8    |7                  |
|92 |чаплин |58    |день_@залМалый::08    |136.4    |7                  |
|93 |чаплин |58    |день_@залМалый::09    |136.4    |7                  |
|94 |чаплин |58    |день_@залМалый::10    |118.8    |7                  |
|95 |чаплин |58    |день_@залМалый::11    |118.8    |7                  |
|96 |чаплин |58    |день_@залМалый::12    |136.4    |7                  |
|97 |чаплин |58    |вечер_@залМалый::01   |149.6    |8                  |
|98 |чаплин |58    |вечер_@залМалый::02   |149.6    |8                  |
|99 |чаплин |58    |вечер_@залМалый::03   |149.6    |8                  |
|100|чаплин |58    |вечер_@залМалый::04   |149.6    |8                  |
|101|чаплин |58    |вечер_@залМалый::05   |149.6    |8                  |
|102|чаплин |58    |вечер_@залМалый::06   |132      |8                  |
|103|чаплин |58    |вечер_@залМалый::07   |132      |8                  |
|104|чаплин |58    |вечер_@залМалый::08   |149.6    |8                  |
|105|чаплин |58    |вечер_@залМалый::09   |149.6    |8                  |
|106|чаплин |58    |вечер_@залМалый::10   |132      |8                  |
|107|чаплин |58    |вечер_@залМалый::11   |132      |8                  |
|108|чаплин |58    |вечер_@залМалый::12   |149.6    |8                  |
*/


-- нахождение прибыльного фильма
select
    tmp.film_name as 'самый_прибыльный_фильм'
from (
     select
         f.name as film_name, sum(t.price) as total_film__price
     from "_ticket" t
              left join "_demostration" d on t.demonstation_id = d.id
              left join "_hall" h on d.hall_id = h.id
              left join "_session" sess on d.session_id  = sess.id
              left join "_film" f on d.film_id  = f.id
              left join "_status" s on t.status_id = s.id
              left join "_seating_position" sp on t.position_id = sp.id
     where s.name = 'продан'
     group by f.name
 ) as tmp
order by tmp.total_film__price desc limit 1;

/*
|самый_прибыльный_фильм|
|----------------------|
|фитиль                |
*/


-- дополнительный скрипт
-- фильтр списка показов
-- -- по фильму "чаплин"
-- -- в "малом" зале
-- -- для места "01"
SELECT
    f.name AS 'фильм',
    (s."text" || '_' || h.name || '::' || seat.name) AS 'сеанс',
        ((sp.attendance_rate + d.attendance_rate)*cnf.coefficient) AS 'коэф.цены',
    d.id AS 'идент_показа(служ.)'
FROM '_demostration' AS d
    JOIN '_seating_position' AS sp ON sp.hall_id = d.hall_id
    JOIN '_hall' AS h ON h.id = d.hall_id
    JOIN '_seat' as seat ON seat.id = sp.seat_id
    JOIN '_session' AS s ON s.id = d.session_id
    JOIN '_film' AS f ON f.id = d.film_id
WHERE seat.name!='@service' and f.name='чаплин' and h.name='@залМалый' and seat.name='01';

/*
|фильм |сеанс              |коэф.цены|идент_показа(служ.)|
|------|-------------------|---------|-------------------|
|чаплин|утро_@залМалый::01 |123.2    |1                  |
|чаплин|день_@залМалый::01 |136.4    |7                  |
|чаплин|вечер_@залМалый::01|149.6    |8                  |
*/
