
-- самый прибыльный фильм
select
    tmp.film_name as 'самый_прибыльный_фильм'
from (
    select
        f.name as film_name, sum(t.price) as total_film__price
    from "_ticket" t
    left join "_demostration" d on t.demonstation_id = d.id
    left join "_hall" h on d.hall_id = h.id
    left join "_session" sess on d.session_id  = sess.id
    left join "_film" f on d.film_id  = f.id 
    left join "_status" s on t.status_id = s.id
    left join "_seating_position" sp on t.position_id = sp.id
    where s.name = 'продан'
    group by f.name
) as tmp
order by tmp.total_film__price desc limit 1;
/*
|самый_прибыльный_фильм|
|----------------------|
|фитиль                |
*/


-- items with Price
SELECT 
    ROW_NUMBER () OVER (ORDER BY d.id) AS '###',
    f.name AS 'фильм',
    f.duration_in_minutes AS '(мин.)',
    (s."text" || '_' || h.name || '::' || seat.name) AS 'сеанс',
    ((sp.attendance_rate + d.attendance_rate + h.seating_capacity)*0.88) AS 'коэф.цены',
    d.id AS 'идент_показа(служ.)'
FROM '_demostration' AS d
JOIN '_seating_position' AS sp ON sp.hall_id = d.hall_id 
JOIN '_hall' AS h ON h.id = d.hall_id
JOIN 'seat' as seat ON seat.id = sp.seat_id
JOIN '_session' AS s ON s.id = d.session_id 
JOIN '_film' AS f ON f.id = d.film_id 
WHERE seat.name!='@service';

/*
|###|фильм  |(мин.)|сеанс                 |коэф.цены|идент_показа(служ.)|
|---|-------|------|----------------------|---------|-------------------|
|1  |чаплин |58    |утро_@залМалый::01    |120.56   |1                  |
|2  |чаплин |58    |утро_@залМалый::02    |111.76   |1                  |
|3  |чаплин |58    |утро_@залМалый::03    |120.56   |1                  |
|4  |чаплин |58    |утро_@залМалый::04    |120.56   |1                  |
|5  |чаплин |58    |утро_@залМалый::05    |120.56   |1                  |
|6  |чаплин |58    |утро_@залМалый::06    |117.92   |1                  |
|7  |чаплин |58    |утро_@залМалый::07    |120.56   |1                  |
|8  |чаплин |58    |утро_@залМалый::08    |129.36   |1                  |
|9  |чаплин |58    |утро_@залМалый::09    |129.36   |1                  |
|10 |чаплин |58    |утро_@залМалый::10    |129.36   |1                  |
|11 |чаплин |58    |утро_@залМалый::11    |129.36   |1                  |
|12 |чаплин |58    |утро_@залМалый::12    |129.36   |1                  |
|13 |ералаш |140   |вечер_@залМалый::01   |120.56   |2                  |
|14 |ералаш |140   |вечер_@залМалый::02   |111.76   |2                  |
|15 |ералаш |140   |вечер_@залМалый::03   |120.56   |2                  |
|16 |ералаш |140   |вечер_@залМалый::04   |120.56   |2                  |
|17 |ералаш |140   |вечер_@залМалый::05   |120.56   |2                  |
|18 |ералаш |140   |вечер_@залМалый::06   |117.92   |2                  |
|19 |ералаш |140   |вечер_@залМалый::07   |120.56   |2                  |
|20 |ералаш |140   |вечер_@залМалый::08   |129.36   |2                  |
|21 |ералаш |140   |вечер_@залМалый::09   |129.36   |2                  |
|22 |ералаш |140   |вечер_@залМалый::10   |129.36   |2                  |
|23 |ералаш |140   |вечер_@залМалый::11   |129.36   |2                  |
|24 |ералаш |140   |вечер_@залМалый::12   |129.36   |2                  |
|25 |чаплин |58    |утро_@залОсновной::01 |75.68    |3                  |
|26 |чаплин |58    |утро_@залОсновной::02 |75.68    |3                  |
|27 |чаплин |58    |утро_@залОсновной::03 |75.68    |3                  |
|28 |чаплин |58    |утро_@залОсновной::04 |75.68    |3                  |
|29 |чаплин |58    |утро_@залОсновной::05 |84.48    |3                  |
|30 |чаплин |58    |утро_@залОсновной::06 |84.48    |3                  |
|31 |чаплин |58    |утро_@залОсновной::07 |84.48    |3                  |
|32 |чаплин |58    |утро_@залОсновной::08 |84.48    |3                  |
|33 |чаплин |58    |утро_@залОсновной::09 |97.68    |3                  |
|34 |чаплин |58    |утро_@залОсновной::10 |97.68    |3                  |
|35 |чаплин |58    |утро_@залОсновной::11 |97.68    |3                  |
|36 |чаплин |58    |утро_@залОсновной::12 |97.68    |3                  |
|37 |чаплин |58    |утро_@залОсновной::13 |115.28   |3                  |
|38 |чаплин |58    |утро_@залОсновной::14 |115.28   |3                  |
|39 |чаплин |58    |утро_@залОсновной::15 |115.28   |3                  |
|40 |чаплин |58    |утро_@залОсновной::16 |115.28   |3                  |
|41 |фитиль |140   |вечер_@залОсновной::01|62.48    |4                  |
|42 |фитиль |140   |вечер_@залОсновной::02|62.48    |4                  |
|43 |фитиль |140   |вечер_@залОсновной::03|62.48    |4                  |
|44 |фитиль |140   |вечер_@залОсновной::04|62.48    |4                  |
|45 |фитиль |140   |вечер_@залОсновной::05|71.28    |4                  |
|46 |фитиль |140   |вечер_@залОсновной::06|71.28    |4                  |
|47 |фитиль |140   |вечер_@залОсновной::07|71.28    |4                  |
|48 |фитиль |140   |вечер_@залОсновной::08|71.28    |4                  |
|49 |фитиль |140   |вечер_@залОсновной::09|84.48    |4                  |
|50 |фитиль |140   |вечер_@залОсновной::10|84.48    |4                  |
|51 |фитиль |140   |вечер_@залОсновной::11|84.48    |4                  |
|52 |фитиль |140   |вечер_@залОсновной::12|84.48    |4                  |
|53 |фитиль |140   |вечер_@залОсновной::13|102.08   |4                  |
|54 |фитиль |140   |вечер_@залОсновной::14|102.08   |4                  |
|55 |фитиль |140   |вечер_@залОсновной::15|102.08   |4                  |
|56 |фитиль |140   |вечер_@залОсновной::16|102.08   |4                  |
|57 |фитиль |140   |вечер_@залМалый::01   |85.36    |5                  |
|58 |фитиль |140   |вечер_@залМалый::02   |76.56    |5                  |
|59 |фитиль |140   |вечер_@залМалый::03   |85.36    |5                  |
|60 |фитиль |140   |вечер_@залМалый::04   |85.36    |5                  |
|61 |фитиль |140   |вечер_@залМалый::05   |85.36    |5                  |
|62 |фитиль |140   |вечер_@залМалый::06   |82.72    |5                  |
|63 |фитиль |140   |вечер_@залМалый::07   |85.36    |5                  |
|64 |фитиль |140   |вечер_@залМалый::08   |94.16    |5                  |
|65 |фитиль |140   |вечер_@залМалый::09   |94.16    |5                  |
|66 |фитиль |140   |вечер_@залМалый::10   |94.16    |5                  |
|67 |фитиль |140   |вечер_@залМалый::11   |94.16    |5                  |
|68 |фитиль |140   |вечер_@залМалый::12   |94.16    |5                  |
|69 |титаник|130   |день_@залОсновной::01 |62.48    |6                  |
|70 |титаник|130   |день_@залОсновной::02 |62.48    |6                  |
|71 |титаник|130   |день_@залОсновной::03 |62.48    |6                  |
|72 |титаник|130   |день_@залОсновной::04 |62.48    |6                  |
|73 |титаник|130   |день_@залОсновной::05 |71.28    |6                  |
|74 |титаник|130   |день_@залОсновной::06 |71.28    |6                  |
|75 |титаник|130   |день_@залОсновной::07 |71.28    |6                  |
|76 |титаник|130   |день_@залОсновной::08 |71.28    |6                  |
|77 |титаник|130   |день_@залОсновной::09 |84.48    |6                  |
|78 |титаник|130   |день_@залОсновной::10 |84.48    |6                  |
|79 |титаник|130   |день_@залОсновной::11 |84.48    |6                  |
|80 |титаник|130   |день_@залОсновной::12 |84.48    |6                  |
|81 |титаник|130   |день_@залОсновной::13 |102.08   |6                  |
|82 |титаник|130   |день_@залОсновной::14 |102.08   |6                  |
|83 |титаник|130   |день_@залОсновной::15 |102.08   |6                  |
|84 |титаник|130   |день_@залОсновной::16 |102.08   |6                  |
*/
