--
-- 1. Выбор всех фильмов на сегодня
select
    f.name as "фильм",
    (((CAST((sp.attendance_rate + d.attendance_rate) AS FLOAT) / 1000)+cnf.coefficient)*f.price)::int AS "цена",
        (sess."text" || '_' || h.name || '::' || sp.seat_place || '~' || sp.name) AS "сеанс",
    s.name as "статус",
    t.showen_date as "дата показа",
    t.purchasen_date::date as "дата брони/продажи"
from
    (
        select
            tck.id as id,
            tck.showen_date as showen_date,
            tck.purchasen_date as purchasen_date,
            tck.demonstration_id as demonstration_id,
            tck.status_id as status_id,
            tck.position_id as position_id
        from ticket tck where tck.showen_date=now()::date
    ) t
left join demonstration d
          on t.demonstration_id = d.id
left join dict_hall h
          on d.hall_id = h.id --
left join dict_session sess
          on d.session_id  = sess.id
left join film f
          on d.film_id  = f.id
left join dict_status s
          on t.status_id = s.id
left join seating_position sp
          on t.position_id = sp.id
left join "_config" AS cnf ON cnf.id = 1;
/*
|фильм                           |цена|сеанс                                                  |статус  |дата показа|дата брони/продажи|
|--------------------------------|----|-------------------------------------------------------|--------|-----------|------------------|
|титаник                         |134 |день_@залОсновной::7~@heal_01--seat_07                 |продан  |2023-12-22 |2023-11-21        |
|фильм--382323                   |149 |день_@залБольшой::62~@hall_03--row_02--numb_22--seat   |свободен|2023-12-22 |                  |
|Создание Мира Гарри Поттера 2009|141 |утро_@залОсновной::47~@hall_03--row_02--numb_07--seat  |свободен|2023-12-22 |                  |
|фильм--584992                   |177 |утро_@залМалый::140~@hall_03--row_05--numb_27--seat    |продан  |2023-12-22 |2023-11-21        |
|фильм--302253                   |193 |день_@залОсновной::51~@hall_03--row_02--numb_11--seat  |бронь   |2023-12-22 |2023-12-17        |
|фильм--603413                   |153 |вечер_@залОсновной::76~@hall_03--row_03--numb_13--seat |продан  |2023-12-22 |2023-11-21        |
|фильм--48090                    |102 |вечер_@залБольшой::129~@hall_03--row_05--numb_16--seat |свободен|2023-12-22 |                  |
|фильм--949719                   |178 |утро_@залОсновной::144~@hall_03--row_06--numb_03--seat |свободен|2023-12-22 |                  |
|фильм--53787                    |112 |день_@залОсновной::22~@hall_03--row_01--numb_03--seat  |продан  |2023-12-22 |2023-11-21        |
|фильм--387300                   |148 |ночь_@залОсновной::69~@hall_03--row_03--numb_06--seat  |свободен|2023-12-22 |                  |
|фильм--627656                   |149 |день_@залОсновной::108~@hall_03--row_04--numb_21--seat |бронь   |2023-12-22 |2023-12-17        |
|фильм--506749                   |128 |вечер_@залМалый::87~@hall_03--row_03--numb_24--seat    |свободен|2023-12-22 |                  |
|фильм--506749                   |128 |вечер_@залМалый::67~@hall_03--row_03--numb_04--seat    |бронь   |2023-12-22 |2023-12-17        |
|фильм--987591                   |178 |ночь_@залОсновной::221~@hall_03--row_08--numb_20--seat |бронь   |2023-12-22 |2023-12-17        |
|фильм--961397                   |114 |вечер_@залОсновной::149~@hall_03--row_06--numb_08--seat|продан  |2023-12-22 |2023-11-21        |
|фильм--622649                   |145 |день_@залОсновной::86~@hall_03--row_03--numb_23--seat  |продан  |2023-12-22 |2023-12-15        |
|фильм--464584                   |124 |день_@залМалый::103~@hall_03--row_04--numb_16--seat    |свободен|2023-12-22 |                  |
|фильм--556508                   |149 |вечер_@залОсновной::133~@hall_03--row_05--numb_20--seat|бронь   |2023-12-22 |2023-12-17        |
|фильм--291789                   |113 |вечер_@залОсновной::181~@hall_03--row_07--numb_11--seat|продан  |2023-12-22 |2023-11-21        |
|фильм--329030                   |136 |день_@залОсновной::75~@hall_03--row_03--numb_12--seat  |бронь   |2023-12-22 |2023-12-17        |
|фильм--329030                   |136 |день_@залОсновной::22~@hall_03--row_01--numb_03--seat  |бронь   |2023-12-22 |2023-12-17        |
|фильм--329030                   |134 |день_@залОсновной::154~@hall_03--row_06--numb_13--seat |продан  |2023-12-22 |2023-11-21        |
|фильм--338805                   |157 |вечер_@залБольшой::163~@hall_03--row_06--numb_22--seat |бронь   |2023-12-22 |2023-12-17        |
|фильм--338805                   |161 |вечер_@залБольшой::111~@hall_03--row_04--numb_24--seat |продан  |2023-12-22 |2023-11-21        |
|фильм--677752                   |144 |утро_@залМалый::142~@hall_03--row_06--numb_01--seat    |бронь   |2023-12-22 |2023-12-17        |
|фильм--584771                   |145 |ночь_@залМалый::165~@hall_03--row_06--numb_24--seat    |продан  |2023-12-22 |2023-11-21        |
|фильм--800052                   |141 |вечер_@залОсновной::188~@hall_03--row_07--numb_18--seat|бронь   |2023-12-22 |2023-12-17        |
|фильм--586807                   |184 |утро_@залБольшой::73~@hall_03--row_03--numb_10--seat   |продан  |2023-12-22 |2023-11-21        |
|фильм--72448                    |180 |день_@залБольшой::174~@hall_03--row_07--numb_04--seat  |свободен|2023-12-22 |                  |
|фильм--236048                   |160 |вечер_@залБольшой::92~@hall_03--row_04--numb_05--seat  |свободен|2023-12-22 |                  |
|фильм--11265                    |193 |день_@залОсновной::175~@hall_03--row_07--numb_05--seat |продан  |2023-12-22 |2023-11-21        |
|фильм--821034                   |163 |ночь_@залБольшой::11~@hall_03--row_00--numb_11--seat   |продан  |2023-12-22 |2023-11-21        |
|фильм--250086                   |172 |утро_@залОсновной::149~@hall_03--row_06--numb_08--seat |свободен|2023-12-22 |                  |
|фильм--391370                   |112 |утро_@залОсновной::80~@hall_03--row_03--numb_17--seat  |продан  |2023-12-22 |2023-11-21        |
|фильм--55220                    |122 |утро_@залБольшой::161~@hall_03--row_06--numb_20--seat  |свободен|2023-12-22 |                  |
|фильм--81126                    |148 |день_@залБольшой::128~@hall_03--row_05--numb_15--seat  |продан  |2023-12-22 |2023-11-21        |
|фильм--827912                   |122 |ночь_@залМалый::115~@hall_03--row_05--numb_02--seat    |свободен|2023-12-22 |                  |
|фильм--655983                   |122 |утро_@залОсновной::134~@hall_03--row_05--numb_21--seat |продан  |2023-12-22 |2023-11-21        |
|фильм--553899                   |97  |утро_@залМалый::137~@hall_03--row_05--numb_24--seat    |бронь   |2023-12-22 |2023-12-17        |
|фильм--825480                   |153 |утро_@залБольшой::13~@hall_03--row_00--numb_13--seat   |продан  |2023-12-22 |2023-11-21        |
|фильм--50490                    |186 |вечер_@залМалый::153~@hall_03--row_06--numb_12--seat   |бронь   |2023-12-22 |2023-12-17        |
|фильм--13922                    |164 |день_@залБольшой::42~@hall_03--row_02--numb_02--seat   |свободен|2023-12-22 |                  |
|фильм--282296                   |181 |день_@залБольшой::78~@hall_03--row_03--numb_15--seat   |свободен|2023-12-22 |                  |
|фильм--249004                   |103 |вечер_@залМалый::119~@hall_03--row_05--numb_06--seat   |бронь   |2023-12-22 |2023-12-17        |
|фильм--866909                   |155 |ночь_@залОсновной::137~@hall_03--row_05--numb_24--seat |продан  |2023-12-22 |2023-11-21        |
|фильм--689465                   |123 |день_@залБольшой::71~@hall_03--row_03--numb_08--seat   |бронь   |2023-12-22 |2023-12-17        |
|фильм--244498                   |140 |ночь_@залОсновной::100~@hall_03--row_04--numb_13--seat |свободен|2023-12-22 |                  |
|фильм--544663                   |149 |день_@залМалый::150~@hall_03--row_06--numb_09--seat    |продан  |2023-12-22 |2023-11-21        |
|фильм--741876                   |107 |утро_@залМалый::112~@hall_03--row_04--numb_25--seat    |свободен|2023-12-22 |                  |
|фильм--740749                   |118 |день_@залОсновной::96~@hall_03--row_04--numb_09--seat  |бронь   |2023-12-22 |2023-12-17        |
*/


-- 2. Подсчёт проданных билетов за неделю
select
    count(tck.id) as "кол-во проданных билетов"
from ticket tck
where tck.status_id=2
  and
    (
        (((now()::date - interval '1 week')::date) <= tck.purchasen_date)
	and
	(tck.purchasen_date <= (now()::date))
);
/*
|кол-во проданных билетов|
|------------------------|
|363,850                 |
*/


-- 3. Формирование афиши (фильмы, которые показывают сегодня)
select
    f.name as film_name,
    f.duration_in_minutes AS "(мин.)",
    t.price as "цена", --@FixMe
    (sess."text" || '_' || h.name || '::' || sp.seat_place) AS "сеанс",
    t.showen_date as "дата показа"
from (select id, demonstration_id,status_id,position_id,showen_date,price  from ticket where showen_date=now()::date) t
left join demonstration d
       on t.demonstration_id = d.id
left join dict_hall h
       on d.hall_id = h.id
left join dict_session sess
       on d.session_id  = sess.id
left join film f
       on d.film_id  = f.id
left join dict_status s
       on t.status_id = s.id
left join seating_position sp
       on t.position_id = sp.id;
/*
|film_name                       |(мин.)|цена|сеанс                  |дата показа|
|--------------------------------|------|----|-----------------------|-----------|
|титаник                         |130   |93  |день_@залОсновной::7   |2023-12-22 |
|фильм--382323                   |66    |119 |день_@залБольшой::62   |2023-12-22 |
|Создание Мира Гарри Поттера 2009|89    |87  |утро_@залОсновной::47  |2023-12-22 |
|фильм--584992                   |18    |119 |утро_@залМалый::140    |2023-12-22 |
|фильм--302253                   |87    |114 |день_@залОсновной::51  |2023-12-22 |
|фильм--603413                   |33    |119 |вечер_@залОсновной::76 |2023-12-22 |
|фильм--48090                    |85    |119 |вечер_@залБольшой::129 |2023-12-22 |
|фильм--949719                   |59    |119 |утро_@залОсновной::144 |2023-12-22 |
|фильм--53787                    |97    |119 |день_@залОсновной::22  |2023-12-22 |
|фильм--387300                   |56    |119 |ночь_@залОсновной::69  |2023-12-22 |
|фильм--627656                   |50    |119 |день_@залОсновной::108 |2023-12-22 |
|фильм--506749                   |52    |119 |вечер_@залМалый::87    |2023-12-22 |
|фильм--506749                   |52    |119 |вечер_@залМалый::67    |2023-12-22 |
|фильм--987591                   |78    |119 |ночь_@залОсновной::221 |2023-12-22 |
|фильм--961397                   |22    |119 |вечер_@залОсновной::149|2023-12-22 |
|фильм--622649                   |56    |119 |день_@залОсновной::86  |2023-12-22 |
|фильм--464584                   |68    |119 |день_@залМалый::103    |2023-12-22 |
|фильм--556508                   |45    |119 |вечер_@залОсновной::133|2023-12-22 |
|фильм--291789                   |30    |119 |вечер_@залОсновной::181|2023-12-22 |
|фильм--329030                   |80    |119 |день_@залОсновной::75  |2023-12-22 |
|фильм--329030                   |80    |119 |день_@залОсновной::22  |2023-12-22 |
|фильм--329030                   |80    |119 |день_@залОсновной::154 |2023-12-22 |
|фильм--338805                   |44    |119 |вечер_@залБольшой::163 |2023-12-22 |
|фильм--338805                   |44    |119 |вечер_@залБольшой::111 |2023-12-22 |
|фильм--677752                   |34    |119 |утро_@залМалый::142    |2023-12-22 |
|фильм--584771                   |62    |119 |ночь_@залМалый::165    |2023-12-22 |
|фильм--800052                   |79    |119 |вечер_@залОсновной::188|2023-12-22 |
|фильм--586807                   |21    |119 |утро_@залБольшой::73   |2023-12-22 |
|фильм--72448                    |33    |119 |день_@залБольшой::174  |2023-12-22 |
|фильм--236048                   |21    |119 |вечер_@залБольшой::92  |2023-12-22 |
|фильм--11265                    |73    |119 |день_@залОсновной::175 |2023-12-22 |
|фильм--821034                   |37    |119 |ночь_@залБольшой::11   |2023-12-22 |
|фильм--250086                   |87    |125 |утро_@залОсновной::149 |2023-12-22 |
|фильм--391370                   |23    |119 |утро_@залОсновной::80  |2023-12-22 |
|фильм--55220                    |33    |119 |утро_@залБольшой::161  |2023-12-22 |
|фильм--81126                    |105   |119 |день_@залБольшой::128  |2023-12-22 |
|фильм--827912                   |29    |119 |ночь_@залМалый::115    |2023-12-22 |
|фильм--655983                   |94    |119 |утро_@залОсновной::134 |2023-12-22 |
|фильм--553899                   |64    |117 |утро_@залМалый::137    |2023-12-22 |
|фильм--825480                   |82    |119 |утро_@залБольшой::13   |2023-12-22 |
|фильм--50490                    |67    |119 |вечер_@залМалый::153   |2023-12-22 |
|фильм--13922                    |43    |119 |день_@залБольшой::42   |2023-12-22 |
|фильм--282296                   |28    |119 |день_@залБольшой::78   |2023-12-22 |
|фильм--249004                   |87    |119 |вечер_@залМалый::119   |2023-12-22 |
|фильм--866909                   |93    |119 |ночь_@залОсновной::137 |2023-12-22 |
|фильм--689465                   |58    |119 |день_@залБольшой::71   |2023-12-22 |
|фильм--244498                   |9     |119 |ночь_@залОсновной::100 |2023-12-22 |
|фильм--544663                   |63    |119 |день_@залМалый::150    |2023-12-22 |
|фильм--741876                   |53    |87  |утро_@залМалый::112    |2023-12-22 |
|фильм--740749                   |89    |119 |день_@залОсновной::96  |2023-12-22 |
*/


-- 4. Поиск 3 самых прибыльных фильмов за неделю
select
    tmp.film_name,
    sum(tmp.ticket_price)
from (
         select
             f.name as film_name,
             t.price as ticket_price,
             (now()::date - interval '1 week')::date as once_week_ago_date,
                 t.purchasen_date as ticket_purchasen_date,
             now()::date as now_date
         from ticket t
                  left join demonstration d on t.demonstration_id = d.id
                  left join film f on d.film_id  = f.id
         where t.status_id = 2) as tmp
where ((tmp.once_week_ago_date <= tmp.ticket_purchasen_date) and (tmp.ticket_purchasen_date <= tmp.now_date))
group by tmp.film_name
order by sum(tmp.ticket_price) desc
    limit 3;
/*
|film_name    |sum   |
|-------------|------|
|фильм--166298|31,821|
|фильм--475258|27,118|
|фильм--631208|26,900|
*/


-- 5. Сформировать схему зала и показать на ней свободные и занятые места на конкретный сеанс
-- примерное расположение мест в соответствующем зале
-- строка соответствует номеру_в_ряду
-- столбец соответствует номеру_ряда (максимум 10 рядов)
select
    max(case when (l."row"=0) then (l.name||'::'||uc.name) else null end) as "0",
    max(case when (l."row"=1) then (l.name||'::'||uc.name) else null end) as "1",
    max(case when (l."row"=2) then (l.name||'::'||uc.name) else null end) as "2",
    max(case when (l."row"=3) then (l.name||'::'||uc.name) else null end) as "3",
    max(case when (l."row"=4) then (l.name||'::'||uc.name) else null end) as "4",
    max(case when (l."row"=5) then (l.name||'::'||uc.name) else null end) as "5",
    max(case when (l."row"=6) then (l.name||'::'||uc.name) else null end) as "6",
    max(case when (l."row"=7) then (l.name||'::'||uc.name) else null end) as "7",
    max(case when (l."row"=8) then (l.name||'::'||uc.name) else null end) as "8",
    max(case when (l."row"=9) then (l.name||'::'||uc.name) else null end) as "9",
    max(case when(l."row"=10) then (l.name||'::'||uc.name) else null end) as "10"
from
    "location" l
        join seating_position sp on sp.location_id = l.id
        join dict_ui_color uc on uc.id = (sp.attendance_rate/20)
where l.floor =1 and sp.hall_id = 3
GROUP BY l.number_in_row;
/*
|0  |1            |2             |3             |4  |5  |6  |7  |8  |9  |10 |
|---|-------------|--------------|--------------|---|---|---|---|---|---|---|
|   |1-01-01::blue|1-02-01::blue |1-03-01::blue |   |   |   |   |   |   |   |
|   |1-01-02::blue|1-02-02::green|1-03-02::green|   |   |   |   |   |   |   |
|   |1-01-03::blue|1-02-03::green|1-03-03::green|   |   |   |   |   |   |   |
|   |1-01-04::blue|1-02-04::blue |1-03-04::blue |   |   |   |   |   |   |   |


|0  |1            |2             |3             |4  |5  |6  |7  |8  |9  |10 |
|---|-------------|--------------|--------------|---|---|---|---|---|---|---|
|   |1-01-01::blue|1-02-01::blue |1-03-01::blue |   |   |   |   |   |   |   |
|   |1-01-02::blue|1-02-02::green|1-03-02::green|   |   |   |   |   |   |   |
|   |1-01-03::blue|1-02-03::green|1-03-03::green|   |   |   |   |   |   |   |
|   |1-01-04::blue|1-02-04::green|1-03-04::green|   |   |   |   |   |   |   |
|   |             |1-02-05::green|1-03-05::green|   |   |   |   |   |   |   |
|   |             |1-02-06::blue |1-03-06::blue |   |   |   |   |   |   |   |


|0            |1            |2            |3             |4             |5             |6             |7             |8             |9             |10            |
|-------------|-------------|-------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|
|1-00-01::blue|1-01-01::blue|1-02-01::blue|1-03-01::blue |1-04-01::blue |1-05-01::blue |1-06-01::blue |1-07-01::blue |1-08-01::blue |1-09-01::blue |1-10-01::blue |
|1-00-02::blue|1-01-02::blue|1-02-02::blue|1-03-02::blue |1-04-02::blue |1-05-02::blue |1-06-02::blue |1-07-02::blue |1-08-02::blue |1-09-02::blue |1-10-02::blue |
|1-00-03::blue|1-01-03::blue|1-02-03::blue|1-03-03::blue |1-04-03::blue |1-05-03::blue |1-06-03::blue |1-07-03::blue |1-08-03::blue |1-09-03::blue |1-10-03::blue |
|1-00-04::blue|1-01-04::blue|1-02-04::blue|1-03-04::blue |1-04-04::blue |1-05-04::blue |1-06-04::blue |1-07-04::blue |1-08-04::blue |1-09-04::blue |1-10-04::blue |
|1-00-05::blue|1-01-05::blue|1-02-05::blue|1-03-05::blue |1-04-05::blue |1-05-05::blue |1-06-05::blue |1-07-05::blue |1-08-05::blue |1-09-05::blue |1-10-05::blue |
|1-00-06::blue|1-01-06::blue|1-02-06::blue|1-03-06::green|1-04-06::green|1-05-06::green|1-06-06::green|1-07-06::green|1-08-06::green|1-09-06::green|1-10-06::green|
|1-00-07::blue|1-01-07::blue|1-02-07::blue|1-03-07::green|1-04-07::green|1-05-07::green|1-06-07::green|1-07-07::green|1-08-07::green|1-09-07::green|1-10-07::green|
|1-00-08::blue|1-01-08::blue|1-02-08::blue|1-03-08::green|1-04-08::green|1-05-08::green|1-06-08::green|1-07-08::green|1-08-08::green|1-09-08::green|1-10-08::green|
|1-00-09::blue|1-01-09::blue|1-02-09::blue|1-03-09::green|1-04-09::green|1-05-09::green|1-06-09::green|1-07-09::green|1-08-09::green|1-09-09::green|1-10-09::green|
|1-00-10::blue|1-01-10::blue|1-02-10::blue|1-03-10::green|1-04-10::green|1-05-10::green|1-06-10::green|1-07-10::green|1-08-10::green|1-09-10::green|1-10-10::green|
|1-00-11::blue|1-01-11::blue|1-02-11::blue|1-03-11::green|1-04-11::green|1-05-11::green|1-06-11::green|1-07-11::green|1-08-11::green|1-09-11::green|1-10-11::green|
|1-00-12::blue|1-01-12::blue|1-02-12::blue|1-03-12::green|1-04-12::green|1-05-12::green|1-06-12::green|1-07-12::green|1-08-12::green|1-09-12::green|1-10-12::green|
|1-00-13::blue|1-01-13::blue|1-02-13::blue|1-03-13::green|1-04-13::green|1-05-13::green|1-06-13::green|1-07-13::green|1-08-13::green|1-09-13::green|1-10-13::green|
|1-00-14::blue|1-01-14::blue|1-02-14::blue|1-03-14::green|1-04-14::green|1-05-14::green|1-06-14::green|1-07-14::green|1-08-14::green|1-09-14::green|1-10-14::green|
|1-00-15::blue|1-01-15::blue|1-02-15::blue|1-03-15::green|1-04-15::green|1-05-15::green|1-06-15::green|1-07-15::green|1-08-15::green|1-09-15::green|1-10-15::green|
|1-00-16::blue|1-01-16::blue|1-02-16::blue|1-03-16::green|1-04-16::green|1-05-16::green|1-06-16::green|1-07-16::green|1-08-16::green|1-09-16::green|1-10-16::green|
|1-00-17::blue|1-01-17::blue|1-02-17::blue|1-03-17::green|1-04-17::green|1-05-17::green|1-06-17::green|1-07-17::green|1-08-17::green|1-09-17::green|1-10-17::green|
|1-00-18::blue|1-01-18::blue|1-02-18::blue|1-03-18::green|1-04-18::green|1-05-18::green|1-06-18::green|1-07-18::green|1-08-18::green|1-09-18::green|1-10-18::green|
|1-00-19::blue|1-01-19::blue|1-02-19::blue|1-03-19::green|1-04-19::green|1-05-19::green|1-06-19::green|1-07-19::green|1-08-19::green|1-09-19::green|1-10-19::green|
|             |1-01-20::blue|1-02-20::blue|1-03-20::green|1-04-20::green|1-05-20::green|1-06-20::green|1-07-20::green|1-08-20::green|1-09-20::green|1-10-20::green|
|             |1-01-21::blue|1-02-21::blue|1-03-21::blue |1-04-21::green|1-05-21::green|1-06-21::green|1-07-21::green|1-08-21::green|1-09-21::green|1-10-21::green|
|             |             |1-02-22::blue|1-03-22::blue |1-04-22::green|1-05-22::green|1-06-22::green|1-07-22::green|1-08-22::green|1-09-22::green|1-10-22::green|
|             |             |1-02-23::blue|1-03-23::blue |1-04-23::blue |1-05-23::green|1-06-23::green|1-07-23::green|1-08-23::green|1-09-23::green|1-10-23::green|
|             |             |             |1-03-24::blue |1-04-24::blue |1-05-24::green|1-06-24::green|1-07-24::green|1-08-24::green|1-09-24::green|1-10-24::green|
|             |             |             |              |1-04-25::blue |1-05-25::blue |1-06-25::green|1-07-25::green|1-08-25::green|1-09-25::green|1-10-25::green|
|             |             |             |              |1-04-26::blue |1-05-26::blue |1-06-26::blue |1-07-26::green|1-08-26::green|1-09-26::green|1-10-26::green|
|             |             |             |              |              |1-05-27::blue |1-06-27::blue |1-07-27::green|1-08-27::green|1-09-27::green|1-10-27::green|
|             |             |             |              |              |1-05-28::blue |1-06-28::blue |1-07-28::blue |1-08-28::green|1-09-28::green|1-10-28::green|
|             |             |             |              |              |              |1-06-29::blue |1-07-29::blue |1-08-29::blue |1-09-29::green|1-10-29::green|
|             |             |             |              |              |              |              |1-07-30::blue |1-08-30::blue |1-09-30::green|1-10-30::green|
|             |             |             |              |              |              |              |1-07-31::blue |1-08-31::blue |1-09-31::blue |1-10-31::green|
|             |             |             |              |              |              |              |              |1-08-32::blue |1-09-32::blue |1-10-32::green|
|             |             |             |              |              |              |              |              |              |1-09-33::blue |1-10-33::blue |
|             |             |             |              |              |              |              |              |              |1-09-34::blue |1-10-34::blue |
|             |             |             |              |              |              |              |              |              |              |1-10-35::blue |
|             |             |             |              |              |              |              |              |              |              |1-10-36::blue |
|             |             |             |              |              |              |              |              |              |              |1-10-37::blue |
*/


-- примерное расположение мест в соответствующем зале
-- строка соответствует номеру_ряда (максимум 10 рядов)
-- столбец соответствует номеру_в_ряду (максимум 37 мест в ряду)
select  -- OK
        l."row",
        max(case when (l.number_in_row =1) then (l.name||'::'||uc.name) else null end) as "1",
        max(case when (l.number_in_row =2) then (l.name||'::'||uc.name) else null end) as "2",
        max(case when (l.number_in_row =3) then (l.name||'::'||uc.name) else null end) as "3",
        max(case when (l.number_in_row =4) then (l.name||'::'||uc.name) else null end) as "4",
        max(case when (l.number_in_row =5) then (l.name||'::'||uc.name) else null end) as "5",
        max(case when (l.number_in_row =6) then (l.name||'::'||uc.name) else null end) as "6",
        max(case when (l.number_in_row =7) then (l.name||'::'||uc.name) else null end) as "7",
        max(case when (l.number_in_row =8) then (l.name||'::'||uc.name) else null end) as "8",
        max(case when (l.number_in_row =9) then (l.name||'::'||uc.name) else null end) as "9",
        max(case when (l.number_in_row =10) then (l.name||'::'||uc.name) else null end) as "10",
        max(case when (l.number_in_row =11) then (l.name||'::'||uc.name) else null end) as "11",
        max(case when (l.number_in_row =12) then (l.name||'::'||uc.name) else null end) as "12",
        max(case when (l.number_in_row =13) then (l.name||'::'||uc.name) else null end) as "13",
        max(case when (l.number_in_row =14) then (l.name||'::'||uc.name) else null end) as "14",
        max(case when (l.number_in_row =15) then (l.name||'::'||uc.name) else null end) as "15",
        max(case when (l.number_in_row =16) then (l.name||'::'||uc.name) else null end) as "16",
        max(case when (l.number_in_row =17) then (l.name||'::'||uc.name) else null end) as "17",
        max(case when (l.number_in_row =18) then (l.name||'::'||uc.name) else null end) as "18",
        max(case when (l.number_in_row =19) then (l.name||'::'||uc.name) else null end) as "19",
        max(case when (l.number_in_row =20) then (l.name||'::'||uc.name) else null end) as "20",
        max(case when (l.number_in_row =21) then (l.name||'::'||uc.name) else null end) as "21",
        max(case when (l.number_in_row =22) then (l.name||'::'||uc.name) else null end) as "22",
        max(case when (l.number_in_row =23) then (l.name||'::'||uc.name) else null end) as "23",
        max(case when (l.number_in_row =24) then (l.name||'::'||uc.name) else null end) as "24",
        max(case when (l.number_in_row =25) then (l.name||'::'||uc.name) else null end) as "25",
        max(case when (l.number_in_row =26) then (l.name||'::'||uc.name) else null end) as "26",
        max(case when (l.number_in_row =27) then (l.name||'::'||uc.name) else null end) as "27",
        max(case when (l.number_in_row =28) then (l.name||'::'||uc.name) else null end) as "28",
        max(case when (l.number_in_row =29) then (l.name||'::'||uc.name) else null end) as "29",
        max(case when (l.number_in_row =30) then (l.name||'::'||uc.name) else null end) as "30",
        max(case when (l.number_in_row =31) then (l.name||'::'||uc.name) else null end) as "31",
        max(case when (l.number_in_row =32) then (l.name||'::'||uc.name) else null end) as "32",
        max(case when (l.number_in_row =33) then (l.name||'::'||uc.name) else null end) as "33",
        max(case when (l.number_in_row =34) then (l.name||'::'||uc.name) else null end) as "34",
        max(case when (l.number_in_row =35) then (l.name||'::'||uc.name) else null end) as "35",
        max(case when (l.number_in_row =36) then (l.name||'::'||uc.name) else null end) as "36",
        max(case when (l.number_in_row =37) then (l.name||'::'||uc.name) else null end) as "37"
from
    "location" l
        join seating_position sp on sp.location_id = l.id
        join dict_ui_color uc on uc.id = (sp.attendance_rate/20)
where l.floor =1 and sp.hall_id = 3
GROUP BY l."row";
/*
|row|1            |2             |3             |4            |5  |6  |7  |8  |9  |10 |11 |12 |13 |14 |15 |16 |17 |18 |19 |20 |21 |22 |23 |24 |25 |26 |27 |28 |29 |30 |31 |32 |33 |34 |35 |36 |37 |
|---|-------------|--------------|--------------|-------------|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|
|1  |1-01-01::blue|1-01-02::blue |1-01-03::blue |1-01-04::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|2  |1-02-01::blue|1-02-02::green|1-02-03::green|1-02-04::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|3  |1-03-01::blue|1-03-02::green|1-03-03::green|1-03-04::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |


|row|1            |2             |3             |4             |5             |6            |7  |8  |9  |10 |11 |12 |13 |14 |15 |16 |17 |18 |19 |20 |21 |22 |23 |24 |25 |26 |27 |28 |29 |30 |31 |32 |33 |34 |35 |36 |37 |
|---|-------------|--------------|--------------|--------------|--------------|-------------|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|
|1  |1-01-01::blue|1-01-02::blue |1-01-03::blue |1-01-04::blue |              |             |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|2  |1-02-01::blue|1-02-02::green|1-02-03::green|1-02-04::green|1-02-05::green|1-02-06::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
|3  |1-03-01::blue|1-03-02::green|1-03-03::green|1-03-04::green|1-03-05::green|1-03-06::blue|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |


|row|1            |2            |3            |4            |5            |6             |7             |8             |9             |10            |11            |12            |13            |14            |15            |16            |17            |18            |19            |20            |21            |22            |23            |24            |25            |26            |27            |28            |29            |30            |31            |32            |33           |34           |35           |36           |37           |
|---|-------------|-------------|-------------|-------------|-------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|--------------|-------------|-------------|-------------|-------------|-------------|
|0  |1-00-01::blue|1-00-02::blue|1-00-03::blue|1-00-04::blue|1-00-05::blue|1-00-06::blue |1-00-07::blue |1-00-08::blue |1-00-09::blue |1-00-10::blue |1-00-11::blue |1-00-12::blue |1-00-13::blue |1-00-14::blue |1-00-15::blue |1-00-16::blue |1-00-17::blue |1-00-18::blue |1-00-19::blue |              |              |              |              |              |              |              |              |              |              |              |              |              |             |             |             |             |             |
|1  |1-01-01::blue|1-01-02::blue|1-01-03::blue|1-01-04::blue|1-01-05::blue|1-01-06::blue |1-01-07::blue |1-01-08::blue |1-01-09::blue |1-01-10::blue |1-01-11::blue |1-01-12::blue |1-01-13::blue |1-01-14::blue |1-01-15::blue |1-01-16::blue |1-01-17::blue |1-01-18::blue |1-01-19::blue |1-01-20::blue |1-01-21::blue |              |              |              |              |              |              |              |              |              |              |              |             |             |             |             |             |
|2  |1-02-01::blue|1-02-02::blue|1-02-03::blue|1-02-04::blue|1-02-05::blue|1-02-06::blue |1-02-07::blue |1-02-08::blue |1-02-09::blue |1-02-10::blue |1-02-11::blue |1-02-12::blue |1-02-13::blue |1-02-14::blue |1-02-15::blue |1-02-16::blue |1-02-17::blue |1-02-18::blue |1-02-19::blue |1-02-20::blue |1-02-21::blue |1-02-22::blue |1-02-23::blue |              |              |              |              |              |              |              |              |              |             |             |             |             |             |
|3  |1-03-01::blue|1-03-02::blue|1-03-03::blue|1-03-04::blue|1-03-05::blue|1-03-06::green|1-03-07::green|1-03-08::green|1-03-09::green|1-03-10::green|1-03-11::green|1-03-12::green|1-03-13::green|1-03-14::green|1-03-15::green|1-03-16::green|1-03-17::green|1-03-18::green|1-03-19::green|1-03-20::green|1-03-21::blue |1-03-22::blue |1-03-23::blue |1-03-24::blue |              |              |              |              |              |              |              |              |             |             |             |             |             |
|4  |1-04-01::blue|1-04-02::blue|1-04-03::blue|1-04-04::blue|1-04-05::blue|1-04-06::green|1-04-07::green|1-04-08::green|1-04-09::green|1-04-10::green|1-04-11::green|1-04-12::green|1-04-13::green|1-04-14::green|1-04-15::green|1-04-16::green|1-04-17::green|1-04-18::green|1-04-19::green|1-04-20::green|1-04-21::green|1-04-22::green|1-04-23::blue |1-04-24::blue |1-04-25::blue |1-04-26::blue |              |              |              |              |              |              |             |             |             |             |             |
|5  |1-05-01::blue|1-05-02::blue|1-05-03::blue|1-05-04::blue|1-05-05::blue|1-05-06::green|1-05-07::green|1-05-08::green|1-05-09::green|1-05-10::green|1-05-11::green|1-05-12::green|1-05-13::green|1-05-14::green|1-05-15::green|1-05-16::green|1-05-17::green|1-05-18::green|1-05-19::green|1-05-20::green|1-05-21::green|1-05-22::green|1-05-23::green|1-05-24::green|1-05-25::blue |1-05-26::blue |1-05-27::blue |1-05-28::blue |              |              |              |              |             |             |             |             |             |
|6  |1-06-01::blue|1-06-02::blue|1-06-03::blue|1-06-04::blue|1-06-05::blue|1-06-06::green|1-06-07::green|1-06-08::green|1-06-09::green|1-06-10::green|1-06-11::green|1-06-12::green|1-06-13::green|1-06-14::green|1-06-15::green|1-06-16::green|1-06-17::green|1-06-18::green|1-06-19::green|1-06-20::green|1-06-21::green|1-06-22::green|1-06-23::green|1-06-24::green|1-06-25::green|1-06-26::blue |1-06-27::blue |1-06-28::blue |1-06-29::blue |              |              |              |             |             |             |             |             |
|7  |1-07-01::blue|1-07-02::blue|1-07-03::blue|1-07-04::blue|1-07-05::blue|1-07-06::green|1-07-07::green|1-07-08::green|1-07-09::green|1-07-10::green|1-07-11::green|1-07-12::green|1-07-13::green|1-07-14::green|1-07-15::green|1-07-16::green|1-07-17::green|1-07-18::green|1-07-19::green|1-07-20::green|1-07-21::green|1-07-22::green|1-07-23::green|1-07-24::green|1-07-25::green|1-07-26::green|1-07-27::green|1-07-28::blue |1-07-29::blue |1-07-30::blue |1-07-31::blue |              |             |             |             |             |             |
|8  |1-08-01::blue|1-08-02::blue|1-08-03::blue|1-08-04::blue|1-08-05::blue|1-08-06::green|1-08-07::green|1-08-08::green|1-08-09::green|1-08-10::green|1-08-11::green|1-08-12::green|1-08-13::green|1-08-14::green|1-08-15::green|1-08-16::green|1-08-17::green|1-08-18::green|1-08-19::green|1-08-20::green|1-08-21::green|1-08-22::green|1-08-23::green|1-08-24::green|1-08-25::green|1-08-26::green|1-08-27::green|1-08-28::green|1-08-29::blue |1-08-30::blue |1-08-31::blue |1-08-32::blue |             |             |             |             |             |
|9  |1-09-01::blue|1-09-02::blue|1-09-03::blue|1-09-04::blue|1-09-05::blue|1-09-06::green|1-09-07::green|1-09-08::green|1-09-09::green|1-09-10::green|1-09-11::green|1-09-12::green|1-09-13::green|1-09-14::green|1-09-15::green|1-09-16::green|1-09-17::green|1-09-18::green|1-09-19::green|1-09-20::green|1-09-21::green|1-09-22::green|1-09-23::green|1-09-24::green|1-09-25::green|1-09-26::green|1-09-27::green|1-09-28::green|1-09-29::green|1-09-30::green|1-09-31::blue |1-09-32::blue |1-09-33::blue|1-09-34::blue|             |             |             |
|10 |1-10-01::blue|1-10-02::blue|1-10-03::blue|1-10-04::blue|1-10-05::blue|1-10-06::green|1-10-07::green|1-10-08::green|1-10-09::green|1-10-10::green|1-10-11::green|1-10-12::green|1-10-13::green|1-10-14::green|1-10-15::green|1-10-16::green|1-10-17::green|1-10-18::green|1-10-19::green|1-10-20::green|1-10-21::green|1-10-22::green|1-10-23::green|1-10-24::green|1-10-25::green|1-10-26::green|1-10-27::green|1-10-28::green|1-10-29::green|1-10-30::green|1-10-31::green|1-10-32::green|1-10-33::blue|1-10-34::blue|1-10-35::blue|1-10-36::blue|1-10-37::blue|
*/


-- 6. Вывести диапазон миниальной и максимальной цены за билет на конкретный сеанс
select
    demonstration_id as demo_id,
    count(demonstration_id) as count_tickets,
    min(price) as min_price,
    max(price) as max_price
from ticket
group by demonstration_id
order by count(demonstration_id) desc;
/*
|demo_id|count_tickets|min_price|max_price|
|-------|-------------|---------|---------|
|664    |1,135        |73       |125      |
|1,916  |1,125        |73       |125      |
|5,447  |1,114        |73       |125      |
|5,420  |1,113        |73       |125      |
|3,051  |1,109        |73       |125      |
|1,134  |1,109        |73       |125      |
|4,147  |1,107        |73       |125      |
|8,775  |1,103        |73       |125      |
|497    |1,100        |73       |125      |
|1,716  |1,099        |73       |125      |
|670    |1,098        |73       |125      |
|2,641  |1,097        |73       |125      |
|17     |1,095        |73       |125      |
|240    |1,094        |73       |125      |
|4,079  |1,093        |73       |125      |
|5,987  |1,093        |73       |125      |
|6,734  |1,093        |73       |125      |
|9,360  |1,092        |73       |125      |
|5,256  |1,092        |73       |125      |
|5,435  |1,092        |73       |125      |
|7,003  |1,091        |73       |125      |
|5,209  |1,091        |73       |125      |
|1,200  |1,091        |73       |125      |
|6,320  |1,091        |73       |125      |
|7,475  |1,089        |73       |125      |
|7,796  |1,088        |73       |125      |
|8,335  |1,088        |73       |125      |
|7,736  |1,088        |73       |125      |
|7,897  |1,087        |73       |125      |
|4,522  |1,087        |73       |125      |
|7,950  |1,087        |73       |125      |
|6,692  |1,085        |73       |125      |
|6,056  |1,085        |73       |125      |
|7,388  |1,084        |73       |125      |
|1,910  |1,084        |73       |125      |
|4,467  |1,083        |73       |125      |
|724    |1,083        |73       |125      |
|7,264  |1,083        |73       |125      |
|5,945  |1,083        |73       |125      |
|1,475  |1,082        |73       |125      |
|8,373  |1,082        |73       |125      |
|2,509  |1,082        |73       |125      |
|5,731  |1,082        |73       |125      |
|6,585  |1,082        |73       |125      |
|6,931  |1,082        |73       |125      |
|6,418  |1,081        |73       |125      |
|4,686  |1,081        |73       |125      |
|5,914  |1,081        |73       |125      |
|6,569  |1,081        |73       |125      |
|9,923  |1,081        |73       |125      |
*/


